grevaillot/svd_tools/headers/STM32H7x7_CM7/sdmmc1.h
/** @defgroup sdmmc1_sdmmc_dcntr SDMMCDCNTR The SDMMC_DCNTR register loads the value from the data length register (see SDMMC_DLENR) when the DPSM moves from the Idle state to the Wait_R or Wait_S state. As data is transferred, the counter decrements the value until it reaches 0. The DPSM then moves to the Idle state and when there has been no error, the data status end flag (DATAEND) is set.
@{*/


#define SDMMC1_SDMMC_DCNTR_DATACOUNT_SHIFT		0
#define SDMMC1_SDMMC_DCNTR_DATACOUNT_MASK		0x1ffffff
/** @defgroup sdmmc1_sdmmc_dcntr_datacount DATACOUNT Data count value When read, the number of remaining data bytes to be transferred is returned. Write has no effect.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc1_sdmmc_star SDMMCSTAR The SDMMC_STAR register is a read-only register. It contains two types of flag:Static flags (bits [29,21,11:0]): these bits remain asserted until they are cleared by writing to the SDMMC interrupt Clear register (see SDMMC_ICR)Dynamic flags (bits [20:12]): these bits change state depending on the state of the underlying logic (for example, FIFO full and empty flags are asserted and de-asserted as data while written to the FIFO)
@{*/

/** SDMMC1_SDMMC_STAR_IDMABTC IDMA buffer transfer complete. interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_IDMABTC		(1 << 28)
/** SDMMC1_SDMMC_STAR_IDMATE IDMA transfer error. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_IDMATE		(1 << 27)
/** SDMMC1_SDMMC_STAR_CKSTOP SDMMC_CK stopped in Voltage switch procedure. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_CKSTOP		(1 << 26)
/** SDMMC1_SDMMC_STAR_VSWEND Voltage switch critical timing section completion. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_VSWEND		(1 << 25)
/** SDMMC1_SDMMC_STAR_ACKTIMEOUT Boot acknowledgment timeout. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_ACKTIMEOUT		(1 << 24)
/** SDMMC1_SDMMC_STAR_ACKFAIL Boot acknowledgment received (boot acknowledgment check fail). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_ACKFAIL		(1 << 23)
/** SDMMC1_SDMMC_STAR_SDIOIT SDIO interrupt received. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_SDIOIT		(1 << 22)
/** SDMMC1_SDMMC_STAR_BUSYD0END end of SDMMC_D0 Busy following a CMD response detected. This indicates only end of busy following a CMD response. This bit does not signal busy due to data transfer. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_BUSYD0END		(1 << 21)
/** SDMMC1_SDMMC_STAR_BUSYD0 Inverted value of SDMMC_D0 line (Busy), sampled at the end of a CMD response and a second time 2 SDMMC_CK cycles after the CMD response. This bit is reset to not busy when the SDMMCD0 line changes from busy to not busy. This bit does not signal busy due to data transfer. This is a hardware status flag only, it does not generate an interrupt. **/
#define SDMMC1_SDMMC_STAR_BUSYD0		(1 << 20)
/** SDMMC1_SDMMC_STAR_RXFIFOE Receive FIFO empty This is a hardware status flag only, does not generate an interrupt. This bit is cleared when one FIFO location becomes full. **/
#define SDMMC1_SDMMC_STAR_RXFIFOE		(1 << 19)
/** SDMMC1_SDMMC_STAR_TXFIFOE Transmit FIFO empty This bit is cleared when one FIFO location becomes full. **/
#define SDMMC1_SDMMC_STAR_TXFIFOE		(1 << 18)
/** SDMMC1_SDMMC_STAR_RXFIFOF Receive FIFO full This bit is cleared when one FIFO location becomes empty. **/
#define SDMMC1_SDMMC_STAR_RXFIFOF		(1 << 17)
/** SDMMC1_SDMMC_STAR_TXFIFOF Transmit FIFO full This is a hardware status flag only, does not generate an interrupt. This bit is cleared when one FIFO location becomes empty. **/
#define SDMMC1_SDMMC_STAR_TXFIFOF		(1 << 16)
/** SDMMC1_SDMMC_STAR_RXFIFOHF Receive FIFO half full There are at least half the number of words in the FIFO. This bit is cleared when the FIFO becomes half+1 empty. **/
#define SDMMC1_SDMMC_STAR_RXFIFOHF		(1 << 15)
/** SDMMC1_SDMMC_STAR_TXFIFOHE Transmit FIFO half empty At least half the number of words can be written into the FIFO. This bit is cleared when the FIFO becomes half+1 full. **/
#define SDMMC1_SDMMC_STAR_TXFIFOHE		(1 << 14)
/** SDMMC1_SDMMC_STAR_CPSMACT Command path state machine active, i.e. not in Idle state. This is a hardware status flag only, does not generate an interrupt. **/
#define SDMMC1_SDMMC_STAR_CPSMACT		(1 << 13)
/** SDMMC1_SDMMC_STAR_DPSMACT Data path state machine active, i.e. not in Idle state. This is a hardware status flag only, does not generate an interrupt. **/
#define SDMMC1_SDMMC_STAR_DPSMACT		(1 << 12)
/** SDMMC1_SDMMC_STAR_DABORT Data transfer aborted by CMD12. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_DABORT		(1 << 11)
/** SDMMC1_SDMMC_STAR_DBCKEND Data block sent/received. (CRC check passed) and DPSM moves to the READWAIT state. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_DBCKEND		(1 << 10)
/** SDMMC1_SDMMC_STAR_DHOLD Data transfer Hold. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_DHOLD		(1 << 9)
/** SDMMC1_SDMMC_STAR_DATAEND Data transfer ended correctly. (data counter, DATACOUNT is zero and no errors occur). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_DATAEND		(1 << 8)
/** SDMMC1_SDMMC_STAR_CMDSENT Command sent (no response required). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_CMDSENT		(1 << 7)
/** SDMMC1_SDMMC_STAR_CMDREND Command response received (CRC check passed, or no CRC). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_CMDREND		(1 << 6)
/** SDMMC1_SDMMC_STAR_RXOVERR Received FIFO overrun error or IDMA write transfer error. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_RXOVERR		(1 << 5)
/** SDMMC1_SDMMC_STAR_TXUNDERR Transmit FIFO underrun error or IDMA read transfer error. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_TXUNDERR		(1 << 4)
/** SDMMC1_SDMMC_STAR_DTIMEOUT Data timeout. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_DTIMEOUT		(1 << 3)
/** SDMMC1_SDMMC_STAR_CTIMEOUT Command response timeout. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. The Command Timeout period has a fixed value of 64 SDMMC_CK clock periods. **/
#define SDMMC1_SDMMC_STAR_CTIMEOUT		(1 << 2)
/** SDMMC1_SDMMC_STAR_DCRCFAIL Data block sent/received (CRC check failed). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_DCRCFAIL		(1 << 1)
/** SDMMC1_SDMMC_STAR_CCRCFAIL Command response received (CRC check failed). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC1_SDMMC_STAR_CCRCFAIL		(1 << 0)

/**@}*/

