grevaillot/svd_tools/headers/STM32H7x7_CM7/sdmmc1.h
/** @defgroup sdmmc1_sdmmc_icr SDMMCICR The SDMMC_ICR register is a write-only register. Writing a bit with 1 clears the corresponding bit in the SDMMC_STAR status register.
@{*/

/** SDMMC1_SDMMC_ICR_IDMABTCC IDMA buffer transfer complete clear bit Set by software to clear the IDMABTC flag. **/
#define SDMMC1_SDMMC_ICR_IDMABTCC		(1 << 28)
/** SDMMC1_SDMMC_ICR_IDMATEC IDMA transfer error clear bit Set by software to clear the IDMATE flag. **/
#define SDMMC1_SDMMC_ICR_IDMATEC		(1 << 27)
/** SDMMC1_SDMMC_ICR_CKSTOPC CKSTOP flag clear bit Set by software to clear the CKSTOP flag. **/
#define SDMMC1_SDMMC_ICR_CKSTOPC		(1 << 26)
/** SDMMC1_SDMMC_ICR_VSWENDC VSWEND flag clear bit Set by software to clear the VSWEND flag. **/
#define SDMMC1_SDMMC_ICR_VSWENDC		(1 << 25)
/** SDMMC1_SDMMC_ICR_ACKTIMEOUTC ACKTIMEOUT flag clear bit Set by software to clear the ACKTIMEOUT flag. **/
#define SDMMC1_SDMMC_ICR_ACKTIMEOUTC		(1 << 24)
/** SDMMC1_SDMMC_ICR_ACKFAILC ACKFAIL flag clear bit Set by software to clear the ACKFAIL flag. **/
#define SDMMC1_SDMMC_ICR_ACKFAILC		(1 << 23)
/** SDMMC1_SDMMC_ICR_SDIOITC SDIOIT flag clear bit Set by software to clear the SDIOIT flag. **/
#define SDMMC1_SDMMC_ICR_SDIOITC		(1 << 22)
/** SDMMC1_SDMMC_ICR_BUSYD0ENDC BUSYD0END flag clear bit Set by software to clear the BUSYD0END flag. **/
#define SDMMC1_SDMMC_ICR_BUSYD0ENDC		(1 << 21)
/** SDMMC1_SDMMC_ICR_DABORTC DABORT flag clear bit Set by software to clear the DABORT flag. **/
#define SDMMC1_SDMMC_ICR_DABORTC		(1 << 11)
/** SDMMC1_SDMMC_ICR_DBCKENDC DBCKEND flag clear bit Set by software to clear the DBCKEND flag. **/
#define SDMMC1_SDMMC_ICR_DBCKENDC		(1 << 10)
/** SDMMC1_SDMMC_ICR_DHOLDC DHOLD flag clear bit Set by software to clear the DHOLD flag. **/
#define SDMMC1_SDMMC_ICR_DHOLDC		(1 << 9)
/** SDMMC1_SDMMC_ICR_DATAENDC DATAEND flag clear bit Set by software to clear the DATAEND flag. **/
#define SDMMC1_SDMMC_ICR_DATAENDC		(1 << 8)
/** SDMMC1_SDMMC_ICR_CMDSENTC CMDSENT flag clear bit Set by software to clear the CMDSENT flag. **/
#define SDMMC1_SDMMC_ICR_CMDSENTC		(1 << 7)
/** SDMMC1_SDMMC_ICR_CMDRENDC CMDREND flag clear bit Set by software to clear the CMDREND flag. **/
#define SDMMC1_SDMMC_ICR_CMDRENDC		(1 << 6)
/** SDMMC1_SDMMC_ICR_RXOVERRC RXOVERR flag clear bit Set by software to clear the RXOVERR flag. **/
#define SDMMC1_SDMMC_ICR_RXOVERRC		(1 << 5)
/** SDMMC1_SDMMC_ICR_TXUNDERRC TXUNDERR flag clear bit Set by software to clear TXUNDERR flag. **/
#define SDMMC1_SDMMC_ICR_TXUNDERRC		(1 << 4)
/** SDMMC1_SDMMC_ICR_DTIMEOUTC DTIMEOUT flag clear bit Set by software to clear the DTIMEOUT flag. **/
#define SDMMC1_SDMMC_ICR_DTIMEOUTC		(1 << 3)
/** SDMMC1_SDMMC_ICR_CTIMEOUTC CTIMEOUT flag clear bit Set by software to clear the CTIMEOUT flag. **/
#define SDMMC1_SDMMC_ICR_CTIMEOUTC		(1 << 2)
/** SDMMC1_SDMMC_ICR_DCRCFAILC DCRCFAIL flag clear bit Set by software to clear the DCRCFAIL flag. **/
#define SDMMC1_SDMMC_ICR_DCRCFAILC		(1 << 1)
/** SDMMC1_SDMMC_ICR_CCRCFAILC CCRCFAIL flag clear bit Set by software to clear the CCRCFAIL flag. **/
#define SDMMC1_SDMMC_ICR_CCRCFAILC		(1 << 0)

/**@}*/

/** @defgroup sdmmc1_sdmmc_maskr SDMMCMASKR The interrupt mask register determines which status flags generate an interrupt request by setting the corresponding bit to 1.
@{*/

/** SDMMC1_SDMMC_MASKR_IDMABTCIE IDMA buffer transfer complete interrupt enable Set and cleared by software to enable/disable the interrupt generated when the IDMA has transferred all data belonging to a memory buffer. **/
#define SDMMC1_SDMMC_MASKR_IDMABTCIE		(1 << 28)
/** SDMMC1_SDMMC_MASKR_CKSTOPIE Voltage Switch clock stopped interrupt enable Set and cleared by software to enable/disable interrupt caused by Voltage Switch clock stopped. **/
#define SDMMC1_SDMMC_MASKR_CKSTOPIE		(1 << 26)
/** SDMMC1_SDMMC_MASKR_VSWENDIE Voltage switch critical timing section completion interrupt enable Set and cleared by software to enable/disable the interrupt generated when voltage switch critical timing section completion. **/
#define SDMMC1_SDMMC_MASKR_VSWENDIE		(1 << 25)
/** SDMMC1_SDMMC_MASKR_ACKTIMEOUTIE Acknowledgment timeout interrupt enable Set and cleared by software to enable/disable interrupt caused by acknowledgment timeout. **/
#define SDMMC1_SDMMC_MASKR_ACKTIMEOUTIE		(1 << 24)
/** SDMMC1_SDMMC_MASKR_ACKFAILIE Acknowledgment Fail interrupt enable Set and cleared by software to enable/disable interrupt caused by acknowledgment Fail. **/
#define SDMMC1_SDMMC_MASKR_ACKFAILIE		(1 << 23)
/** SDMMC1_SDMMC_MASKR_SDIOITIE SDIO mode interrupt received interrupt enable Set and cleared by software to enable/disable the interrupt generated when receiving the SDIO mode interrupt. **/
#define SDMMC1_SDMMC_MASKR_SDIOITIE		(1 << 22)
/** SDMMC1_SDMMC_MASKR_BUSYD0ENDIE BUSYD0END interrupt enable Set and cleared by software to enable/disable the interrupt generated when SDMMC_D0 signal changes from busy to NOT busy following a CMD response. **/
#define SDMMC1_SDMMC_MASKR_BUSYD0ENDIE		(1 << 21)
/** SDMMC1_SDMMC_MASKR_TXFIFOEIE Tx FIFO empty interrupt enable Set and cleared by software to enable/disable interrupt caused by Tx FIFO empty. **/
#define SDMMC1_SDMMC_MASKR_TXFIFOEIE		(1 << 18)
/** SDMMC1_SDMMC_MASKR_RXFIFOFIE Rx FIFO full interrupt enable Set and cleared by software to enable/disable interrupt caused by Rx FIFO full. **/
#define SDMMC1_SDMMC_MASKR_RXFIFOFIE		(1 << 17)
/** SDMMC1_SDMMC_MASKR_RXFIFOHFIE Rx FIFO half full interrupt enable Set and cleared by software to enable/disable interrupt caused by Rx FIFO half full. **/
#define SDMMC1_SDMMC_MASKR_RXFIFOHFIE		(1 << 15)
/** SDMMC1_SDMMC_MASKR_TXFIFOHEIE Tx FIFO half empty interrupt enable Set and cleared by software to enable/disable interrupt caused by Tx FIFO half empty. **/
#define SDMMC1_SDMMC_MASKR_TXFIFOHEIE		(1 << 14)
/** SDMMC1_SDMMC_MASKR_DABORTIE Data transfer aborted interrupt enable Set and cleared by software to enable/disable interrupt caused by a data transfer being aborted. **/
#define SDMMC1_SDMMC_MASKR_DABORTIE		(1 << 11)
/** SDMMC1_SDMMC_MASKR_DBCKENDIE Data block end interrupt enable Set and cleared by software to enable/disable interrupt caused by data block end. **/
#define SDMMC1_SDMMC_MASKR_DBCKENDIE		(1 << 10)
/** SDMMC1_SDMMC_MASKR_DHOLDIE Data hold interrupt enable Set and cleared by software to enable/disable the interrupt generated when sending new data is hold in the DPSM Wait_S state. **/
#define SDMMC1_SDMMC_MASKR_DHOLDIE		(1 << 9)
/** SDMMC1_SDMMC_MASKR_DATAENDIE Data end interrupt enable Set and cleared by software to enable/disable interrupt caused by data end. **/
#define SDMMC1_SDMMC_MASKR_DATAENDIE		(1 << 8)
/** SDMMC1_SDMMC_MASKR_CMDSENTIE Command sent interrupt enable Set and cleared by software to enable/disable interrupt caused by sending command. **/
#define SDMMC1_SDMMC_MASKR_CMDSENTIE		(1 << 7)
/** SDMMC1_SDMMC_MASKR_CMDRENDIE Command response received interrupt enable Set and cleared by software to enable/disable interrupt caused by receiving command response. **/
#define SDMMC1_SDMMC_MASKR_CMDRENDIE		(1 << 6)
/** SDMMC1_SDMMC_MASKR_RXOVERRIE Rx FIFO overrun error interrupt enable Set and cleared by software to enable/disable interrupt caused by Rx FIFO overrun error. **/
#define SDMMC1_SDMMC_MASKR_RXOVERRIE		(1 << 5)
/** SDMMC1_SDMMC_MASKR_TXUNDERRIE Tx FIFO underrun error interrupt enable Set and cleared by software to enable/disable interrupt caused by Tx FIFO underrun error. **/
#define SDMMC1_SDMMC_MASKR_TXUNDERRIE		(1 << 4)
/** SDMMC1_SDMMC_MASKR_DTIMEOUTIE Data timeout interrupt enable Set and cleared by software to enable/disable interrupt caused by data timeout. **/
#define SDMMC1_SDMMC_MASKR_DTIMEOUTIE		(1 << 3)
/** SDMMC1_SDMMC_MASKR_CTIMEOUTIE Command timeout interrupt enable Set and cleared by software to enable/disable interrupt caused by command timeout. **/
#define SDMMC1_SDMMC_MASKR_CTIMEOUTIE		(1 << 2)
/** SDMMC1_SDMMC_MASKR_DCRCFAILIE Data CRC fail interrupt enable Set and cleared by software to enable/disable interrupt caused by data CRC failure. **/
#define SDMMC1_SDMMC_MASKR_DCRCFAILIE		(1 << 1)
/** SDMMC1_SDMMC_MASKR_CCRCFAILIE Command CRC fail interrupt enable Set and cleared by software to enable/disable interrupt caused by command CRC failure. **/
#define SDMMC1_SDMMC_MASKR_CCRCFAILIE		(1 << 0)

/**@}*/

